app/views/dashboard/user.html.erb

<div class="row">
  <% @years.sort{|a,b|b.year<=>a.year}.each do |year| %>
---
SELECT `years`.* FROM `years` WHERE `years`.`deleted_at` IS NULL

                <span class="d-block mb--1"><%= year.year %></span>
                <small><%= year.action_plans.count %> Rencana Aksi</small>
---
SELECT COUNT(*) FROM `action_plans` WHERE `action_plans`.`deleted_at` IS NULL AND `action_plans`.`year_id` = 1