app/views/dashboard/user.html.erb

SELECT COUNT(*) FROM `action_plans` WHERE `action_plans`.`deleted_at` IS NULL AND `action_plans`.`year_id` = 1
---
        <th>Action plan</th>
            <td><%= year.action_plans.count %></td>