app/views/users/_form.html.erb

SELECT `cities`.* FROM `cities` WHERE `cities`.`deleted_at` IS NULL
---
    <%= form.label :city_id %><br/>
    <%= form.select :city_id ,City.all.collect{|u| [u.city, u.id]} %>

SELECT `roles`.* FROM `roles` WHERE `roles`.`deleted_at` IS NULL
---
    <%= form.label :role_id %><br/>
    <%= form.select :role_id ,Role.all.collect{|u| [u.name_role, u.id]} %>