app/controllers/action_plans_controller.rb

  def create
    @action_plan = ActionPlan.new(action_plan_params)

    respond_to do |format|
      @action_plan.city=City.first
      @action_plan.year=Year.first
---
SELECT  `years`.* FROM `years` WHERE `years`.`deleted_at` IS NULL ORDER BY `years`.`id` ASC LIMIT 1