app/controllers/action_plans_controller.rb

  def index

    if params[:city_id].nil?
      @action_plans =@year.action_plans.where('city_id = ?',current_user.city.id).all
---
SELECT  `cities`.* FROM `cities` WHERE `cities`.`deleted_at` IS NULL AND `cities`.`id` = 1 LIMIT 1
SELECT `action_plans`.* FROM `action_plans` WHERE `action_plans`.`deleted_at` IS NULL AND `action_plans`.`year_id` = 5