app/controllers/action_plans_controller.rb

  def index
    @action_plans =ActionPlan.all
---
SELECT `action_plans`.* FROM `action_plans` WHERE `action_plans`.`deleted_at` IS NULL

  def create
    @action_plan = ActionPlan.new(action_plan_params)

    respond_to do |format|
      @action_plan.city=City.first
      @action_plan.year= @year
      if @action_plan.save
        @b_four = BFour.new(b_jibun_params)
        @b_four.action_plan=@action_plan
        @b_four.save

        @b_eight= BEight.new(b_jibun_params)
        @b_eight.action_plan=@action_plan
        @b_eight.save
---
SELECT  `cities`.* FROM `cities` WHERE `cities`.`deleted_at` IS NULL ORDER BY `cities`.`id` ASC LIMIT 1
INSERT INTO `action_plans` (`city_id`, `year_id`, `code_action_plans`, `action_plan`, `created_at`, `updated_at`, `slug`) VALUES (1, 5, 'nyoab', 'banyo', '2020-02-21 07:11:47', '2020-02-21 07:11:47', '1582269107692804-795a87ee-f319-480a-a559-deab00464176')
INSERT INTO `b_fours` (`action_plan_id`, `created_at`, `updated_at`, `slug`) VALUES (26, '2020-02-21 07:11:48', '2020-02-21 07:11:48', '1582269108099846-a7481cd0-29dc-48a0-8f46-fbd22e9d0780')
INSERT INTO `b_eights` (`action_plan_id`, `created_at`, `updated_at`, `slug`) VALUES (26, '2020-02-21 07:11:48', '2020-02-21 07:11:48', '1582269108229239-ce3e9373-d9c7-455f-b191-f9cd4ff1e495')

    def set_params_url
      # @city = City.friendly.find(params[:year_id])
      @year = Year.friendly.find(params[:year_id])
---
SELECT  `years`.* FROM `years` WHERE `years`.`deleted_at` IS NULL ORDER BY `years`.`id` ASC LIMIT 1

    def set_b_four
      @b_four = BFour.find_by action_plan: @action_plan
---
SELECT  `b_fours`.* FROM `b_fours` WHERE `b_fours`.`deleted_at` IS NULL AND `b_fours`.`action_plan_id` = 24 LIMIT 1

    def set_b_eight
      @b_eight = BEight.find_by action_plan: @action_plan
---
SELECT  `b_eights`.* FROM `b_eights` WHERE `b_eights`.`deleted_at` IS NULL AND `b_eights`.`action_plan_id` = 24 LIMIT 1