app/controllers/b_eights_controller.rb

  def update
    respond_to do |format|
      if @b_eight.update(b_eight_params)
---
UPDATE `b_eights` SET `notulen_file_name` = 'Manajemen_Proyek.pdf', `notulen_content_type` = 'application/pdf', `notulen_file_size` = 3388517, `notulen_updated_at` = '2020-02-20 16:58:02', `foto_kegiatan_file_name` = 'Manajemen_Proyek.pdf', `foto_kegiatan_content_type` = 'application/pdf', `foto_kegiatan_file_size` = 3388517, `foto_kegiatan_updated_at` = '2020-02-20 16:58:02', `materi_file_name` = 'Manajemen_Proyek.pdf', `materi_content_type` = 'application/pdf', `materi_file_size` = 3388517, `materi_updated_at` = '2020-02-20 16:58:02', `scan_document_file_name` = 'Manajemen_Proyek.pdf', `scan_document_content_type` = 'application/pdf', `scan_document_file_size` = 3388517, `scan_document_updated_at` = '2020-02-20 16:58:02', `foto_atau_materi_file_name` = 'Manajemen_Proyek.pdf', `foto_atau_materi_content_type` = 'application/pdf', `foto_atau_materi_file_size` = 3388517, `foto_atau_materi_updated_at` = '2020-02-20 16:58:02', `updated_at` = '2020-02-20 16:58:03' WHERE `b_eights`.`id` = 11

    def set_b_eight
      @b_eight = BEight.friendly.find(params[:id])
---
SELECT  `b_eights`.* FROM `b_eights` WHERE `b_eights`.`deleted_at` IS NULL AND `b_eights`.`id` = 1582174174463347 LIMIT 1

    def set_params_url
      @action_plan = ActionPlan.friendly.find(params[:action_plan_id])
---
SELECT  `action_plans`.* FROM `action_plans` WHERE `action_plans`.`deleted_at` IS NULL AND `action_plans`.`id` = 24 LIMIT 1