app/controllers/b_fours_controller.rb

  def update
    respond_to do |format|
      if @b_four.update(b_four_params)
---
UPDATE `b_fours` SET `notulen_file_name` = 'Manajemen_Proyek.pdf', `notulen_updated_at` = '2020-02-20 17:16:50', `daftar_hadir_file_name` = 'Manajemen_Proyek.pdf', `daftar_hadir_updated_at` = '2020-02-20 17:16:50', `foto_kegiatan_file_name` = 'Manajemen_Proyek.pdf', `foto_kegiatan_updated_at` = '2020-02-20 17:16:50', `materi_file_name` = 'Manajemen_Proyek.pdf', `materi_updated_at` = '2020-02-20 17:16:51', `scan_document_file_name` = 'Manajemen_Proyek.pdf', `scan_document_updated_at` = '2020-02-20 17:16:51', `scan_document_ttd_file_name` = 'Manajemen_Proyek.pdf', `scan_document_ttd_updated_at` = '2020-02-20 17:16:51', `foto_atau_materi_file_name` = 'Manajemen_Proyek.pdf', `foto_atau_materi_updated_at` = '2020-02-20 17:16:51', `updated_at` = '2020-02-20 17:16:51' WHERE `b_fours`.`id` = 11

    def set_params_url
      @action_plan = ActionPlan.friendly.find(params[:action_plan_id])
---
SELECT  `action_plans`.* FROM `action_plans` WHERE `action_plans`.`deleted_at` IS NULL AND `action_plans`.`id` = 24 LIMIT 1