app/controllers/b_twelves_controller.rb

SELECT  `action_plans`.* FROM `action_plans` WHERE `action_plans`.`deleted_at` IS NULL AND `action_plans`.`id` = 24 LIMIT 1
---
    def set_params_url
      @action_plan = ActionPlan.friendly.find(params[:action_plan_id])