app/controllers/cities_controller.rb

SELECT `cities`.* FROM `cities` WHERE `cities`.`deleted_at` IS NULL
---
  def index
    @cities = City.all