app/controllers/dashboard_controller.rb

  def user
    @years = Year.all
---
SELECT `years`.* FROM `years` WHERE `years`.`deleted_at` IS NULL