app/controllers/permissions_controller.rb

  def index
    @permissions = Permission.all
---
SELECT `permissions`.* FROM `permissions` WHERE `permissions`.`deleted_at` IS NULL

  def create
    @permission = Permission.new(permission_params)

    respond_to do |format|
      if @permission.save
---
INSERT INTO `permissions` (`name`, `resource`, `action`, `description`, `page`, `path`, `created_at`, `updated_at`, `slug`) VALUES ('City', 'city', 'index', 'Lihat data kota dan kabupaten', TRUE, 'cities_path', '2020-02-20 16:25:28', '2020-02-20 16:25:28', '1582215928181860-7025787e-05ce-4ec1-bcef-0fe1d3ce8cc2')