app/controllers/role_permissions_controller.rb

SELECT  `role_permissions`.* FROM `role_permissions` WHERE (role_id = 1) AND (permission_id = 1) ORDER BY `role_permissions`.`id` ASC LIMIT 1
SELECT `role_permissions`.* FROM `role_permissions`
---
  def index
    @role = Role.friendly.find(params[:role_id])
    @role_permissions = RolePermission.where('role_id','=',@role)
    @permissions=Permission.all