app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`deleted_at` IS NULL