app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL