app/controllers/years_controller.rb

SELECT `years`.* FROM `years` WHERE `years`.`deleted_at` IS NULL
---
  def index
    @years = Year.all

INSERT INTO `years` (`year`, `created_at`, `updated_at`, `slug`) VALUES ('2019', '2020-02-18 16:39:58', '2020-02-18 16:39:58', '1582043998701366-2defedfb-b9c5-4cac-8e16-e098dc14c142')
---
  def create
    @year = Year.new(year_params)

    respond_to do |format|
      if @year.save