app/models/role_permission.rb

  def self.check_status(role,permission)
      self.where('role_id = ?',role).where('permission_id = ?',permission).first
---
SELECT  `role_permissions`.* FROM `role_permissions` WHERE (role_id = 1) AND (permission_id = 1) ORDER BY `role_permissions`.`id` ASC LIMIT 1