app/views/years/index.html.erb

<div class="row">
<% @years.sort{|a,b|b.year<=>a.year}.each do |year| %>
---
SELECT `years`.* FROM `years` WHERE `years`.`deleted_at` IS NULL